<?php
namespace app\controller\admin\basic;

use \core\acl;
use \core\session;
use \core\golobalvars;

class info extends \app\controller_auth
{
    // ********************************************************************************
    // ****
    // **** アクション
    // ****
    // ********************************************************************************
    //
    // --------------------------------------------------------------------------------
    // 既定
    // --------------------------------------------------------------------------------
    function action_index()
    {
        $this->display();
    }
    // ********************************************************************************
    // ****
    // **** 表示
    // ****
    // ********************************************************************************
    //
    // --------------------------------------------------------------------------------
    // 表示
    // --------------------------------------------------------------------------------
    public function display()
    {
        
        $vars = array
        (
            'phpversion'        => phpversion(),
            'globalvars_dump'   => print_r(golobalvars::get_values()),
            'session_dump'      => print_r(sessionvars::get_values()),
            'acl_dump'          => print_r(acl::get_all()),
        );
        echo $this->render('controller/admin/basic/info/index.twig', $vars);
    }
}