<?php
namespace app\controller\admin\composer;

use \core\response;
use \core\url;

use \app\model\controller\admin\composer\summary as rs_composer;

class summary extends \app\controller_admin
{
    private $rs_composer;
    // ********************************************************************************
    // **** アクション
    // ********************************************************************************
    // --------------------------------------------------------------------------------
    // コントローラー起動事前処理
    // --------------------------------------------------------------------------------
    public function before()
    {
        parent::before();
        //
        $this->rs_composer = new rs_composer();
    }
    // --------------------------------------------------------------------------------
    // 既定
    // --------------------------------------------------------------------------------
    public function action_index($params)
    {
        $this->display();
    }
    // --------------------------------------------------------------------------------
    // 並べ替えアクション
    // --------------------------------------------------------------------------------
    public function action_sort($params)
    {
        $this->rs_composer->sort($params);
    }
    // ********************************************************************************
    // **** 表示
    // ********************************************************************************
    // --------------------------------------------------------------------------------
    // 表示
    // --------------------------------------------------------------------------------
    private function display()
    {
        $rs_composer = new rs_composer();
        //
        $vars = array
        (
            'rs_composer' => $this->rs_composer->fetch_all(),
        );
        echo $this->render('controller/admin/composer/summary.twig', $vars);
    }
}