<?php
namespace app\controller\admin\stackgroup;

use \core\db;
use \core\response;
use \core\url;

use \app\model\controller\admin\stackgroup\summary as rs_stackgroup;

class summary extends \app\controller_admin
{
    // ********************************************************************************
    // **** アクション
    // ********************************************************************************
    // --------------------------------------------------------------------------------
    // コントローラー起動事前処理
    // --------------------------------------------------------------------------------
    public function before()
    {
        parent::before();
    }
    // --------------------------------------------------------------------------------
    // 既定
    // --------------------------------------------------------------------------------
    public function action_index($params)
    {
        $this->display();
    }
    // --------------------------------------------------------------------------------
    // 並べ替えアクション
    // --------------------------------------------------------------------------------
    public function action_sort($params)
    {
        $rs_stackgroup = new rs_stackgroup();
        $rs_stackgroup->sort($params);
    }
    // ********************************************************************************
    // **** 表示
    // ********************************************************************************
    // --------------------------------------------------------------------------------
    // 表示
    // --------------------------------------------------------------------------------
    private function display()
    {
        $rs_stackgroup = new rs_stackgroup();
        //
        $vars = array
        (
            'rs_stackgroup' => $rs_stackgroup->fetch_all(),
        );
        echo $this->render('controller/admin/stackgroup/summary.twig', $vars);
    }
}