<?php
namespace app\controller\admin\stackgroup;

use \core\db;
use \core\response;
use \core\url;

use \app\model\controller\admin\stackgroup\summary as drec_stackgroup;

class summary extends \app\controller_auth
{
    //
    // ********************************************************************************
    // ****
    // **** アクション
    // ****
    // ********************************************************************************
    //
    // --------------------------------------------------------------------------------
    // コントローラー起動事前処理
    // --------------------------------------------------------------------------------
    //
    public function before()
    {
        parent::before();
    }
    //
    // --------------------------------------------------------------------------------
    // 既定
    // --------------------------------------------------------------------------------
    //
    public function action_index($params)
    {
        $this->display();
    }
    //
    // --------------------------------------------------------------------------------
    // 並べ替えアクション
    // --------------------------------------------------------------------------------
    //
    public function action_sort($params)
    {
        $drec_stackgroup = new drec_stackgroup();
        $drec_stackgroup->sort($params);
    }
    //
    // ********************************************************************************
    // ****
    // **** 表示
    // ****
    // ********************************************************************************
    //
    // --------------------------------------------------------------------------------
    // 表示
    // --------------------------------------------------------------------------------
    //
    private function display()
    {
        $drec_stackgroup = new drec_stackgroup();
        //
        $vars = array
        (
            'drec_stackgroup' => $drec_stackgroup->fetch_all(),
        );
        echo $this->render('controller/admin/stackgroup/summary.twig', $vars);
    }
}