<?php
namespace core;

class controller
{
    public $route;
    // --------------------------------------------------------------------------------
    // 既定のアクション
    // --------------------------------------------------------------------------------
    public function before()
    {
        debug::trace('[core/controller/before] : 開始');
        return true;
    }
    // --------------------------------------------------------------------------------
    // 既定のアクション
    // --------------------------------------------------------------------------------
    public function after()
    {
        debug::trace('[core/controller/after] : 開始');
        return true;
    }
}
