<?php
namespace core;

class dispatch {
    // --------------------------------------------------------------------------------
    // コントローラーをパラメーターに従って実行
    // --------------------------------------------------------------------------------
    public static function run($route)
    {
        debug::trace('[core/dispatch/run] : 開始');
        // ------------------------------------------------------------
        // コントローラー作成
        // ------------------------------------------------------------
        $controller = new $route->controller_name;
        $controller->route = $route;
        // ------------------------------------------------------------
        // 既定（開始時）のアクションの実行
        // ------------------------------------------------------------
        if (method_exists($controller, 'before'))
        {
            $controller->before();
        }
        // ------------------------------------------------------------
        // アクションの実行
        // ------------------------------------------------------------
        $action_name = $route->action_name;
        $controller->$action_name($route->params);
        // ------------------------------------------------------------
        // 既定（終了時）アクションの実行
        // ------------------------------------------------------------
        if (method_exists($controller, 'after'))
        {
            $controller->after();
        }
        return true;
    } 
}
