<?php
namespace core;

class dispatch {
    //
    const UNIQ_KEY = 'CORE_LIB_DISPATCH';
    //
    private $route;
    // --------------------------------------------------------------------------------
    // コントローラーをパラメーターに従って実行
    // --------------------------------------------------------------------------------
    public static function run($route)
    {
        // ------------------------------------------------------------
        // コントローラー作成
        // ------------------------------------------------------------
        $controller = new $route->controller_name;
        $controller->route = $route;
        // ------------------------------------------------------------
        // 既定（開始時）のアクションの実行
        // ------------------------------------------------------------
        if (method_exists($controller, 'before'))
        {
            $controller->before($route->params);
        }
        // ------------------------------------------------------------
        // アクションの実行
        // ------------------------------------------------------------
        $action_name = $route->action_name;
        $controller->$action_name($route->params);
        // ------------------------------------------------------------
        // 既定（終了時）アクションの実行
        // ------------------------------------------------------------
        if (method_exists($controller, 'after'))
        {
            $controller->after($route->params);
        }
        //
        return true;
    } 
}
