<?php
namespace app\cspman\model\controller\project_task;

use \core\db;

class delete extends \app\cspman\model\controller\project_task\base
{
    // ################################################################################
    // 検証
    // ################################################################################
    // --------------------------------------------------------------------------------
    // 検証（削除）
    // --------------------------------------------------------------------------------
    public function check()
    {
        return $this->is_valid;
    }
    // ################################################################################
    // データ操作
    // ################################################################################
    // --------------------------------------------------------------------------------
    // 削除
    // --------------------------------------------------------------------------------
    public function delete()
    {
        $con = new db();
        //
        $sql = <<< EOT
DELETE
FROM
    cspman_project_task
WHERE
    project_task_id = :project_task_id;
EOT;
        $sql_params = array
        (
            ':project_task_id' => $this->get_value('project_task_id'),
        );
        $con->query($sql, $sql_params);
    }
}