<?php
namespace app\cscms\controller\admin\mediafolder;

use \core\db;
use \core\response;
use \core\url;

use \app\cscms\model\controller\admin\mediafolder\summary as rs_folder;

class summary extends \app\controller_admin
{
    // ********************************************************************************
    // **** アクション
    // ********************************************************************************
    // --------------------------------------------------------------------------------
    // コントローラー起動事前処理
    // --------------------------------------------------------------------------------
    public function before()
    {
        parent::before();
    }
    // --------------------------------------------------------------------------------
    // 既定
    // --------------------------------------------------------------------------------
    public function action_index($params)
    {
        $this->display();
    }
    // ********************************************************************************
    // **** 表示
    // ********************************************************************************
    // --------------------------------------------------------------------------------
    // 表示
    // --------------------------------------------------------------------------------
    private function display()
    {
        $rs_folder = new rs_folder();
        //
        $vars = array
        (
            'rs_folder' => $rs_folder->fetch_all(),
        );
        //
        echo $this->render('cscms/controller/admin/mediafolder/summary.twig', $vars);
    }
}