<?php
namespace app\model\controller\admin\auth;

use \core\db;
use \core\file;

class login extends \core\fieldset
{
    // ################################################################################
    // コンストラクタ
    // ################################################################################
    public function __construct()
    {
        parent::__construct();
        //
        $this->append('username',   'ユーザー名');
        $this->append('password',   'パスワード');
    }
    // ################################################################################
    // データ操作
    // ################################################################################
    // --------------------------------------------------------------------------------
    // 検証
    // --------------------------------------------------------------------------------
    public function check()
    {
        $this->validate('required', 'username');
        $this->validate('required', 'password');
    }
}