<?php
namespace app\cscms\model\controller\admin\composer;

use \core\db;

class delete extends \app\cscms\model\controller\admin\composer\base
{
    // ################################################################################
    // 検証
    // ################################################################################
    // --------------------------------------------------------------------------------
    // 検証（削除）
    // --------------------------------------------------------------------------------
    public function validate_delete()
    {
        return $this->is_valid;
    }
    // ################################################################################
    // データ操作
    // ################################################################################
    // --------------------------------------------------------------------------------
    // 削除
    // --------------------------------------------------------------------------------
    public function delete()
    {
        $con = new db();
        //
        $sql = <<< EOT
DELETE
FROM
    cs_composer
WHERE
    composer_key = :composer_key;
EOT;
        $sql_params = array
        (
            ':composer_key' => $this->get_value('composer_key'),
        );
        //
        $con->query($sql, $sql_params);
    }
}